application/src/test/resources/json/payments/responseOrderIdNull.json

{
  "accounts_info": null,
  "acquirer_reconciliation": [],
  "additional_info": {
    "authentication_code": null,
    "available_balance": null,
    "ip_address": "181.165.110.50",
    "items": [
      {
        "category_id": "MLA3530",
        "description": null,
        "id": "MLA1391052063",
        "picture_url": null,
        "quantity": "1",
        "title": "Item De Prueba - Por Favor, No Ofertar",
        "unit_price": "45000.0"
      }
    ],
    "nsu_processadora": null
  },
  "authorization_code": "301299",
  "binary_mode": false,
  "brand_id": null,
  "build_version": "3.21.0",
  "call_for_authorize_id": null,
  "captured": true,
  "card": {
    "bin": "50317557",
    "cardholder": { "identification": { "number": "01111111", "type": "DNI" }, "name": "test test" },
    "date_created": "2023-10-16T17:51:21.000-04:00",
    "date_last_updated": "2023-10-16T17:51:21.000-04:00",
    "expiration_month": 11,
    "expiration_year": 2025,
    "first_six_digits": "503175",
    "id": "9275697637",
    "last_four_digits": "0604"
  },
  "charges_details": [
    {
      "accounts": { "from": "collector", "to": "ml" },
      "amounts": { "original": 18900, "refunded": 0 },
      "client_id": 5084470480389975,
      "date_created": "2023-10-16T17:51:26.000-04:00",
      "id": "65245438575-001",
      "last_updated": "2023-10-16T17:51:26.000-04:00",
      "metadata": {},
      "name": "meli_fee",
      "refund_charges": [],
      "reserve_id": null,
      "type": "fee"
    }
  ],
  "collector_id": 1482791421,
  "corporation_id": null,
  "counter_currency": null,
  "coupon_amount": 0,
  "currency_id": "ARS",
  "date_approved": "2023-10-16T17:51:21.000-04:00",
  "date_created": "2023-10-16T17:51:21.000-04:00",
  "date_last_updated": "2023-10-16T17:51:27.000-04:00",
  "date_of_expiration": null,
  "deduction_schema": null,
  "description": "Item De Prueba - Por Favor, No Ofertar",
  "differential_pricing_id": 33678187,
  "external_reference": "2000006684847072",
  "fee_details": [{ "amount": 18900, "fee_payer": "collector", "type": "application_fee" }],
  "financing_group": null,
  "id": 65245438575,
  "installments": 6,
  "integrator_id": null,
  "issuer_id": "3",
  "live_mode": true,
  "marketplace_owner": null,
  "merchant_account_id": null,
  "merchant_number": null,
  "metadata": { "official_store_id": null },
  "money_release_date": "2023-11-13T17:51:21.000-04:00",
  "money_release_schema": null,
  "money_release_status": "pending",
  "notification_url": null,
  "operation_type": "regular_payment",
  "order": { "id": null, "type": "mercadolibre" },
  "payer": {
    "email": null,
    "entity_type": null,
    "first_name": null,
    "id": "1484081588",
    "identification": {},
    "last_name": null,
    "operator_id": null,
    "phone": {},
    "type": "registered"
  },
  "payment_method": { "data": { "routing_data": { "merchant_account_id": "5927925591444" } }, "id": "master", "issuer_id": "3", "type": "credit_card" },
  "payment_method_id": "master",
  "payment_type_id": "credit_card",
  "platform_id": null,
  "point_of_interaction": {
    "business_info": { "sub_unit": "checkout_on", "unit": "marketplace" },
    "location": { "source": "shipment", "state_id": "AR-C" },
    "transaction_data": { "e2e_id": null },
    "type": "CHECKOUT"
  },
  "pos_id": null,
  "processing_mode": "aggregator",
  "refunds": [],
  "shipping_amount": 0,
  "sponsor_id": null,
  "statement_descriptor": "Mercadopago*fake",
  "status": "approved",
  "status_detail": "accredited",
  "store_id": null,
  "tags": null,
  "taxes_amount": 0,
  "transaction_amount": 45000,
  "transaction_amount_refunded": 0,
  "transaction_details": {
    "acquirer_reference": null,
    "external_resource_url": null,
    "financial_institution": null,
    "installment_amount": 7500,
    "net_received_amount": 26100,
    "overpaid_amount": 0,
    "payable_deferral_period": null,
    "payment_method_reference_id": null,
    "total_paid_amount": 45000
  }
}